#dream beginner

wed해킹: 웹 서버와  클라이언트 사이에 발생하는 취약점이요한 공격
system해킹: 소프트웨어의 취약점을 찾아 공격

reverse engineering: 프로그램을 역으로 분석하여 작동원리 알아내는 기술, 취약점 파악이나 악성 행동을 분석하는 데 사용됨
write up: 해킹 문제에서 플래그 찾는(문제 풀이)과정 정리한 것

<진법>
한 자릿수에 표현할 수 있는 숫자의 개수를 나타냄 -> n진법은 0부터 n-1까지의 숫자나 문자로 나타내는 것

2진법은 0,1의 조합으로 숫자를 나타낼 수 있음
2진수로 숫자를 표현할 때 보통 0b라는 접두어를 붙여 사용함 ex) 10진수 7은 2진수로 0b111로 표기

16진법은 0~9,A~F로 수를 표현하는 것 -> 2진수 0b1100은 16진수로 0xC로 표기한다

1. 2진수-> 10진수 변환방법


<비트,바이트>
비트(bit)는 컴퓨터에서 사용하는 데이터의 최소단위다. 
바이트(byte)는 비트 8개로 구성되며 이는 메모리에 저장되는 최소단위다.
1바이트는 2^8=256 가지의 숫자를 표기할 수 있음

MSB:최상위 비트로 이진데이터에서 제일 왼쪽에 있는 비트를 의미( 최상위인 이유는 제일 왼쪽 숫자가 숫자의 크기에 가장큰 영향을 줘서)
LSB:최하위 비트로 제일 오른쪽에 있는 비트 의미

부호가 있는 데이터(signed 데이터) 의 경우 MSB가 0이면 양수,1이면 음수를 나타냄
